# Membalik urutan baris dan kolom pada Data Frame

# Import Modules

In [1]:
import pandas as pd
import numpy as np

# Creating The Data Frame

In [2]:
n_rows = 5
n_cols = 5
columns = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows,n_cols)),columns=columns)
df

   A  B  C  D  E
0  4  6  9  5  5
1  4  5  8  7  6
2  5  9  5  8  4
3  7  1  2  8  4
4  6  4  1  9  9

# membalik Urutan Kolom

In [3]:
df.loc[:,::-1]

   E  D  C  B  A
0  5  5  9  6  4
1  6  7  8  5  4
2  4  8  5  9  5
3  4  8  2  1  7
4  9  9  1  4  6

# Membalik Urutan Baris

In [4]:
df.loc[::-1]

   A  B  C  D  E
4  6  4  1  9  9
3  7  1  2  8  4
2  5  9  5  8  4
1  4  5  8  7  6
0  4  6  9  5  5

# Membalik Urutan Baris Dan Melakukan Penyesuaian Ulang Index

In [5]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  6  4  1  9  9
1  7  1  2  8  4
2  5  9  5  8  4
3  4  5  8  7  6
4  4  6  9  5  5